"""
Функция-генератор, которая возвращает нечетные числа из диапазона range(30).
"""
def get_number():
 for i in range(30):
  if i % 2 != 0:
   yield i
   
# Создание объекта-генератора
ns = get_number()

# Поиск и вывод первого, пятого и последнего значения
count = 0
for n in ns:
 count += 1
 if count == 1:
  print(f"Первое нечетное число: {n}")
 elif count == 5:
  print(f"Пятое нечетное число: {n}")
 elif count == 15: # Последнее нечетное число в диапазоне
  print(f"Последнее нечетное число: {n}")
  break
